Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.DWFMarkup Property
 An external resource type representing DWF markups data. This type is reserved for future expansion but not yet implemented.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType DWFMarkup { get; }
Public Shared ReadOnly Property DWFMarkup As ExternalResourceType
	Get
public:
static property ExternalResourceType^ DWFMarkup {
	ExternalResourceType^ get ();
}
static member DWFMarkup : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace